In [1]:
import pandas as pd
import numpy as np 
df = pd.read_csv('Mini Project - Marks Adding.csv')

In [2]:
df.head()

    Roll Num  Marks
0  102003542      1
1  102003640      1
2  102003725      1
3  102003307      1
4  102003458      1

In [9]:
df.groupby(by='Roll Num')

    Roll Num  Marks
0  102003542      1
1  102003640      1
2  102003725      1
3  102003307      1
4  102003458      1